Repository: ViktoriaLi/MyCV
Catalog: CV_by_V.Likhotkina/CV_by_V.Likhotkina/Controller/Translation/all_txt/*.xliff
Languages: uk

# CFBundleName
source: $(PRODUCT_NAME)
uk: Українська версія

source: At Unit Factory I started programming and have learned fundamentals like data structures, memory, file management etc. Except projects on C language I passed several intensives, such C++, which gave me OOP basic experience. Also I passed IOS/Swift intensive course and I continue to study this area from that time.
uk: В Unit Factory я почала програмувати та вивчати структіри даних, роботу з пам'яттю, файлами тощо. окрім проектів на мові С я пройшла декілька інтенсивних курсів, таких як С++, де я вивчала основи ООП. Також я пройшла інтенсивний курс по Swift та IOS розробці і наразі продовжую вивчати цей напрям

source: Currently learning Swift and IOS development, passing courses, doing training projects.
uk: На данний момент я вивчаю Swift та IOS розробку, прохожду онлайн курси, роблю навчальні проекти.

source: Dec 2015 - Jan 2017
uk: Грудень 2015 - Січень 2017

source: English
uk: Англійська

# Familiar with
source: Familiar with this framework, basic used in one project
uk: Знайома з даним фреймворком, використовувала його базові можливості в одному з проектів

source: Grocery IT company which developed event management system consisting of CMS, websites and mobile applications. I worked with team of developers and testers, created test cases for all products and performed all stages of testing manually.
uk: Продуктова ІТ компанія, яка займається розробкою системи управління бізнес-подій, що складається з CMS, вебсайти та мобільні додатки. Я працювала з командою розробників та тестувальників, забезпечувала тестове покриття та виконання всіх етапів тестування вручну.

source: Had tested manually websites and mobile apps in commercial projects as QA during 2 years.
uk: Протягом 2 років виконувала вручну тестування веб-сайтів та мобільних додатків в комерційних проекта в якості Тестувальника ПЗ.

source: I had been studying C for over a year, passed 10 training projects in UNIT Factory.
uk: Понад рік вивчала мову С, виконала 10 учбових проектів в UNIT Factory.

source: Jan 2017 - Sep 2017
uk: Січень 2017 - Вересень 2017

source: Kyiv National University of Trade and Economics
uk: Київський національний торговельно-економічний університет

# Made requests in training projects via URLSession and Alamofire
source: Made API requests in training projects via URLSession and Alamofire.
uk: Робила API запити в учбових проектах, використовуючи URLSession та Alamofire.

source: Master of Management
uk: Магістр з менеджменту

source: One and half year in UNIT Factory with 10 learning projects done on C language.
uk: Півтора року навчання в UNIT Factory та 10 виконаних учбових проектів на мові С

source: QA Engineer
uk: QA Інженер

source: Russian
uk: Російська

source: Self learning during practice IOS development
uk: Самостійне вивчення в процесі виконання проектів для IOS

source: Self learning from December 2018. Passed intensive and several training projects in UNIT Factory.
uk: Самостійне вивчення з грудня 2018 року. Пройшла інтенсивний курс та зробитла декілька учбових проектів в UNIT Factory

source: September 2017 - present
uk: Вересень 2017 - теперішній час

source: Startup company which project is secure messenger (mobile apps and web version). Being a single tester I have organized testing process and performed all cycle of manual testing.
uk: Український стартап, проектом якого є месенджер для безпечного спілкування (мобільні додатки та веб версія). Будучи єдиним тестувальником на проекті, я організувала процес тестування та виконувала повний цикл мануального тестування.

source: Student (Swift, C)
uk: Студентка (Swift, C)

source: Student, Computer science
uk: Студентка, Комп'ютерні науки

source: Ukrainian
uk: Українська

# Used for version control of training projects
source: Using for version control of training projects
uk: Використовую для контролю версій учбових проектів

source: Used in training projects
uk: Використовувала в учбових проектах

source: Used on previos job for bug tracking
uk: Використовувала на попередній роботі для відстеження помилок

source: Viktoria
uk: Вікторія

source: Worked with Agile methodology, team work experience.
uk: Працювала за методологією Agile, досвід роботи в команді

source: Worked with this methodology on previos job
uk: Працювала за цією методологією на попередній роботі

# Ліхоткіна
source: Likhotkina
uk: Ліхоткіна

# 1Aa-XZ-m8L.text
source: for
uk: для

# QF8-ca-g5D.text
source: CV by
uk: Резюме

# RGT-v7-GiN.text
source: Viktoria Likhotkina
uk: Вікторії Ліхоткіної

# xhV-Yc-yNE.text
source: MacPaw Summer Internship 2019
uk: літнього стажування в MacPaw, 2019

# 7U6-qa-nA3.title
source: Education
uk: Освіта

# 79b-F5-E9C.text
source: greetingText
uk: Вітання

# BYZ-38-t0r.title
source: Summary
uk: Короткий опис

# DeD-I4-IRV.text
source: About me
uk: Про мене

# Oa3-Ei-lcQ.title
source: Summary & Contacts
uk: Короткий опис та контакти

# Ovh-HT-c2n.title
source: Skills
uk: Навички

# PfT-Hj-i6j.title
source: Education & Languages
uk: Освіта та знання мов

# RbR-fU-Wge.text
source: Instituion
uk: Навчальний заклад

# Rjb-oN-A6N.title
source: Experience
uk: Досвід

# Tfq-Fu-qD9.normalTitle
source: See progress
uk: Поточний прогрес

# VDp-Vx-fzc.text
source: Summary
uk: Короткі відомості

# VJZ-c0-Byk.text
source: Duration
uk: Тривалість

# Wj7-ta-VVq.title
source: About me
uk: Про мене

# bbu-Tg-Y0o.text
source: Degree
uk: Ступінь

# gSy-g9-qMa.title
source: Skills
uk: Навички

# ibc-GS-KfI.text
source: Languages
uk: Мови

# kXj-IW-pEj.text
source: phoneNumber
uk: Номер телефону

# lT0-IR-uwe.title
source: Work experience
uk: Досвід роботи

# nUM-dp-vs1.text
source: Education
uk: Освіта

# zJM-Uk-oKu.title
source: Portfolio
uk: Портфоліо
